Autodesk.Revit.DB.Visual.AssetProperty.SetReadOnlyInternal(System.Boolean)
Set the read-only property of the object.

Autodesk.Revit.DB.Visual.AssetProperty.IsValidSchemaIdentifier(System.String)
Check that schema name is valid
schemaID:
The schema name.
Returns:
True if the schema name is valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetProperty.RemoveConnectedAsset
Removes the connected asset attached to this asset property if any.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
-or-
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetProperty.AddCopyAsConnectedAsset(Autodesk.Revit.DB.Visual.Asset)
Makes a copy of the asset and connects it to this property.
pRenderingAsset:
The asset to duplicate and associate with this property as a connected asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
-or-
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
-or-
Asset property is already connected to one asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetProperty.AddConnectedAsset(System.String)
Adds a new connected asset attached to this asset property, if it allows it.
Remarks:
Cannot add a connected asset if one is already connected.
Use RemoveConnectedAsset() to avoid an exception being thrown.
A new preset asset is created and connected to the property.
For "UnifiedBitmap", it contains an empty property unifiedbitmap_Bitmap.
schema:
The schema name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The schema name is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable.
-or-
Cannot check validity for a property not being edited in AppearanceAssetEditScope.
-or-
Asset property is already connected to one asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetProperty.IsEditable
Check if property can be edited.
Remarks:
Properties can be edited only if there is an active Edit Scope and if the property is allowed to be changed.
Returns:
True if property is editable.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The asset property is not editable. Asset can be edited only in an edit scope.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetProperty.GetConnectedPropertiesNames
Gets names of all connected properties.
Returns:
A list of the names of the connected properties.
Since:
2014

Autodesk.Revit.DB.Visual.AssetProperty.GetAllConnectedProperties
Gets the list of the connected properties.
Connected properties are the detachable properties of an AssetProperty.
e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
Returns:
A list of the connected properties.
Since:
2014

Autodesk.Revit.DB.Visual.AssetProperty.GetConnectedProperty(System.String)
Gets a connected property by its name.
Remarks:
Returns NULL is there is no connected property with the specified name.
name:
Name of the property.
Returns:
The property with the specified name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Visual.AssetProperty.GetSingleConnectedAsset
Gets the single connected asset attached to this asset property, if it exists.
Remarks:
Throws if there is more than one connected asset.
Returns:
The connected asset, or null if there is no connected asset.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Asset is connected to more than one asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetProperty.GetConnectedProperty(System.Int32)
Gets one connected property with specified index.
Returns:
The AProperty of that index.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index is out of range.
Since:
2014

Autodesk.Revit.DB.Visual.AssetProperty.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Visual.AssetProperty.IsReadOnly
Identifies if the object is read-only or modifiable.
If true, the object may not be modified.  If false, the object's contents may be modified.

Autodesk.Revit.DB.Visual.AssetProperty.NumberOfConnectedProperties
The number of currently connected properties.
Since:
2014

Autodesk.Revit.DB.Visual.AssetProperty.GetTypeName(Autodesk.Revit.DB.Visual.AssetPropertyType)
Get the name of the AssetProperty
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when type is AssetPropertyType::Unknown.

Autodesk.Revit.DB.Visual.AssetProperty.Type
Returns the type of the AssetProperty

Autodesk.Revit.DB.Visual.AssetProperty.Name
Get the name of the AssetProperty

Autodesk.Revit.DB.Visual.AssetProperty
Represents a property of material.
Remarks:
AssetProperty is the base class or all other AssetProperty sub classes.